export interface Archive {
  name: string;
  abbr: string;
}

export const ARCHIVES: Archive[] = [
  { name: "Державний архів Вінницької області", abbr: "ДАВіО" },
  { name: "Державний архів Волинської області", abbr: "ДАВоО" },
  { name: "Державний архів Дніпропетровської області", abbr: "ДАДнО" },
  { name: "Державний архів Донецької області", abbr: "ДАДоО" },
  { name: "Державний архів Житомирської області", abbr: "ДАЖО" },
  { name: "Державний архів Закарпатської області", abbr: "ДАЗкО" },
  { name: "Державний архів Запорізької області", abbr: "ДАЗпО" },
  { name: "Державний архів Івано-Франківської області", abbr: "ДАІФО" },
  { name: "Державний архів Київської області", abbr: "ДАКО" },
  { name: "Державний архів міста Києва", abbr: "ДАК" },
  { name: "Державний архів Кіровоградської області", abbr: "ДАКрО" },
  { name: "Державний архів Луганської області", abbr: "ДАЛуО" },
  { name: "Державний архів Львівської області", abbr: "ДАЛО" },
  { name: "Державний архів Миколаївської області", abbr: "ДАМО" },
  { name: "Державний архів Одеської області", abbr: "ДАОО" },
  { name: "Державний архів Полтавської області", abbr: "ДАПО" },
  { name: "Державний архів Рівненської області", abbr: "ДАРО" },
  { name: "Державний архів Сумської області", abbr: "ДАСО" },
  { name: "Державний архів Тернопільської області", abbr: "ДАТО" },
  { name: "Державний архів Харківської області", abbr: "ДАХО" },
  { name: "Державний архів Херсонської області", abbr: "ДАХеО" },
  { name: "Державний архів Хмельницької області", abbr: "ДАХмО" },
  { name: "Державний архів Черкаської області", abbr: "ДАЧкО" },
  { name: "Державний архів Чернівецької області", abbr: "ДАЧвО" },
  { name: "Державний архів Чернігівської області", abbr: "ДАЧгО" },
  { name: "Державний архів в Автономній Республіці Крим", abbr: "ДААРК"},
  { name: "Центральний державний архів вищих органів влади та управління України", abbr: "ЦДАВО" },
  { name: "Центральний державний архів громадських об'єднань України", abbr: "ЦДАГО" },
  { name: "Центральний державний історичний архів України, м. Київ", abbr: "ЦДІАК" },
  { name: "Центральний державний історичний архів України, м. Львів", abbr: "ЦДІАЛ" },
];

export function filterArchives(query: string): Archive[] {
  const q = query.toLowerCase();
  return ARCHIVES.filter(
    (a) =>
      a.name.toLowerCase().includes(q) || a.abbr.toLowerCase().includes(q)
  );
}
